benchmark/results/optimistic_vu50.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/optimistic.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 55s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 25s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 10/50 VUs, 75 complete and 0 interrupted iterations
default   [   4% ] 10/50 VUs  01.0s/25.0s

running (02.0s), 20/50 VUs, 184 complete and 0 interrupted iterations
default   [   8% ] 20/50 VUs  02.0s/25.0s

running (03.0s), 30/50 VUs, 319 complete and 0 interrupted iterations
default   [  12% ] 30/50 VUs  03.0s/25.0s

running (04.0s), 40/50 VUs, 478 complete and 0 interrupted iterations
default   [  16% ] 40/50 VUs  04.0s/25.0s

running (05.0s), 49/50 VUs, 618 complete and 0 interrupted iterations
default   [  20% ] 49/50 VUs  05.0s/25.0s

running (06.0s), 50/50 VUs, 767 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  06.0s/25.0s

running (07.0s), 50/50 VUs, 928 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  07.0s/25.0s

running (08.0s), 50/50 VUs, 1092 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  08.0s/25.0s

running (09.0s), 50/50 VUs, 1236 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  09.0s/25.0s

running (10.0s), 50/50 VUs, 1382 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  10.0s/25.0s

running (11.0s), 50/50 VUs, 1523 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  11.0s/25.0s

running (12.0s), 50/50 VUs, 1644 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  12.0s/25.0s

running (13.0s), 50/50 VUs, 1723 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  13.0s/25.0s

running (14.0s), 50/50 VUs, 1802 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  14.0s/25.0s

running (15.0s), 50/50 VUs, 1886 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  15.0s/25.0s

running (16.0s), 50/50 VUs, 1955 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  16.0s/25.0s

running (17.0s), 50/50 VUs, 2047 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  17.0s/25.0s

running (18.0s), 50/50 VUs, 2129 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  18.0s/25.0s

running (19.0s), 50/50 VUs, 2200 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  19.0s/25.0s

running (20.0s), 50/50 VUs, 2324 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  20.0s/25.0s

running (21.0s), 50/50 VUs, 2472 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  21.0s/25.0s

running (22.0s), 50/50 VUs, 2610 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  22.0s/25.0s

running (23.0s), 50/50 VUs, 2742 complete and 0 interrupted iterations
default   [  92% ] 50/50 VUs  23.0s/25.0s

running (24.0s), 50/50 VUs, 2893 complete and 0 interrupted iterations
default   [  96% ] 50/50 VUs  24.0s/25.0s

running (25.0s), 50/50 VUs, 3032 complete and 0 interrupted iterations
default   [ 100% ] 50/50 VUs  25.0s/25.0s


  █ TOTAL RESULTS 

    checks_total.......: 3082   121.920551/s
    checks_succeeded...: 20.08% 619 out of 3082
    checks_failed......: 79.91% 2463 out of 3082

    ✗ status is 200
      ↳  20% — ✓ 619 / ✗ 2463

    CUSTOM
    optimistic_attempt_count.......: avg=4.386113 min=1       med=5        p(90)=5        p(95)=5        p(99)=5        max=5       

    HTTP
    http_req_duration..............: avg=366.87ms min=13.51ms med=371.64ms p(90)=641.49ms p(95)=708.45ms p(99)=963.34ms max=1.07s   
      { expected_response:true }...: avg=115.88ms min=13.51ms med=52.53ms  p(90)=314.31ms p(95)=381.65ms p(99)=633.62ms max=980.32ms
    http_req_failed................: 79.91% 2463 out of 3082
    http_reqs......................: 3082   121.920551/s

    EXECUTION
    iteration_duration.............: avg=367.4ms  min=13.8ms  med=372.37ms p(90)=641.69ms p(95)=708.55ms p(99)=963.48ms max=1.07s   
    iterations.....................: 3082   121.920551/s
    vus............................: 50     min=10           max=50
    vus_max........................: 50     min=50           max=50

    NETWORK
    data_received..................: 645 kB 26 kB/s
    data_sent......................: 744 kB 29 kB/s



running (25.3s), 00/50 VUs, 3082 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  25s